#Задание1։
# int(function)
# function((input:"py"*3))=n
# print ("Python"+n)

#Задание2։
#print("7p7p7p79")

#Задание3։
# n=9999999
# print(n)

#Задание4
# a = int(input("Введите сумму пополнения:"))
# b = int(input("Введите сумму покупки:"))
# n = 0

# while (a-b)>0:
#     a-=b
#     n += 1
#     b=int(input("Введите сумму покупки:"))

# print(a,n)

#Задание5
# number = 5 # int

# digit = -4.54356876 # float
# word = "Результат:" # string
# boolean = True # bool

# str_num = '5' # string

# # print(word + str(digit))

# print(word + str(number + int(str_num)))

# del number

# number = 7
# first = sec = third = 1 # Всем трём переменным будет присвоено значение 1
# first, sec, third = "Hi", 75, 23.1 # Поочередное присвоение значений
# print("Результат:", number , first, sec, third)

#Задание6
# a = int(input())
# b = int(input())
# c = int(input())
# d = int(input())
# e = int(input())
# h = int(input())
# i = int(input())
# g = int(input())
# k = int(input())
# l = int(input())
# number = [a, b, c, d, e, h, i, g, k, l]
# if number > 20:
#     print("true")
# else:
#     print("false")

#Задание6 Вариант 2
# number = [int(i) for i in input(10).split(10)]#Здесь через пробел вводите нужное количество цифр. Называется эта конструкция генератор списков

# number = [int(i) for i in input(10).split(10)]
# for i in number:
#     if i > 20:
#         print('True')
#     else:
#         print('False')

